var CoreCard_db =
[
    {"name":"引雷针","mode":"进攻性","effect":"\"普通攻击（射击）命中敌人时有25%几率使敌人进入5秒的感电状态。"},
    {"name":"木头人","mode":"特种型","effect":"\"每隔5秒发出宕机数据流使距离自身X码内的一名敌人进入2秒的宕机状态。"},
    {"name":"防火墙","mode":"守护型","effect":"\"获得一个拥有X点生命值且可以在5秒内未受到攻击后进行自我修复的护盾，护盾若被破坏则从核心里移除此芯片。"},
    {"name":"钱之呼吸","mode":"特种型","effect":"获得的金币量增加50%（若敌人会掉落金币则改为：敌人掉落金币的概率增加至100%）"},
    {"name":"BIOS/格式化","mode":"特种型","effect":"当受到致命伤害时，免疫这次伤害并恢复自身生命值至50%，并从核心里移除此芯片。"},
    {"name":"键盘艺术","mode":"特种型","effect":"与神秘商人（或其他）进行讨价时，成功的概率增加至99%。"},
]