var story_db =
    [
        { "id": "1", "title": "改造伞", "story": "1957年，北京师范大学老焱若教授从人体肘关节能曲能伸受到启发，想到若能根据这个原叮功耻嘉侪黄抽萎处联理，制造一种像人的肘关节一样伸曲灵活的折叠伞，人们携带起来就方便多了，于是，他对现行伞进行改进，设计出了图纸，并亲手制定出加工工艺及模具设计，最后与北京一家机械加工厂——中孚工厂达成协仪，由该厂承制并销售。折叠伞因其携带方便而深受广大群众欢迎，没过多久，便在全国各地流行开来。" },
        { "id": "2", "title": "", "story": "奥菲利娅·德莱尼是一个年轻的女人，被她和父母在奥尔德斯托镇度过的童年所困扰。德莱尼家族几代人都拥有一大片地产，在20世纪被用于许多事情。那里发生的所有可怕事件仍然未知。欧菲莉亚被迫离开小镇，搬到抚养她的姨妈家。现在，10年后，她被过去的影像、压抑的记忆和清醒的梦折磨着。那些和她最亲近的人建议越来越激进的治疗方法。失败之后，欧菲莉亚确信她只能在她出生的地方被治愈。她必须回到德莱尼学院。" },
        { "id": "3", "title": "", "story": "末日后的世界中，幸存的人类未来生存而自相残杀的故事，探索人类在困境下的心理波动。在游戏中我们将会扮演一名中年父亲乔尔，为了完成“萤火虫”组织首领的嘱托而带领着14岁的小女孩艾莉展开了一次足以改变两人一生的旅程。" },
        { "id": "4", "title": "", "story": "“如果当人工智能有了自己的智慧和灵魂，这个世界将何去何从？”这是近年来人们一直在讨论的问题，而《底特律：变人》就像我们讲述了一个这样的故事，主角卡拉是一个为人类服务的家政型机器人，但是却发生了异常拥有了感情，她将与其余有感情的机器人一起探索关于人的定义。我们家在游戏中扮演三名仿生人主角，再一个个选择中决定他们将会成为什么样的人，并见证当机器人拥有感情后，这个世界将会变成什么样。" },
        { "id": "5", "title": "", "story": "《巫师3：狂猎》是一款由波兰著名小说改编而来做角色扮演类单机游戏，是巫师系列作品的第三部，精彩的原著小说赋予了游戏真实的人物设定和扣人心弦的故事剧情，除此之外，游戏还拥有庞大的无缝衔接的世界地图，并采取非线性的任务模式和剧情设定，玩家们将在游戏中做出多种选择，而这些选择也都将影响到故事的最终结局，游戏里的一切都将由玩家们自己演绎。" },
        { "id": "6", "title": "", "story": "《去月球》虽然是一款只有几个小时流程的微型像素风游戏，但是却凭借着精美细腻的演出效果和感人肺腑的故事剧情而获得了无数好评，与其说是有游戏，不如说是一款令人惊艳的视觉小说。故事讲述了两名医生准备为垂死的老人实现临终前的愿望——去月球，虽然老人早已忘记了去月球的理由，但是我们在游戏中随着一些重要物品的出现，将见证老人一生中的许多重要时刻，并解开它过去的秘密，以不一样的方式像玩家们讲述了一场唯美的爱情故事。" },
        { "id": "7", "title": "", "story": "围绕在「Major Fletcher」士兵身上，主角将穿越仅存的人类城市「Bezoar」，冒险旅途上的各种考验与磨难随之而来，同时还得击退来自各方憎恨人类的生化机器人。" },
        { "id": "8", "title": "不要到那里去", "story": "众所周知这个城市有一个地方是绝对不能去的，身经百战的战士同样也葬身于此地，但是话不过3秒主角就按捺不住自己的好奇心，想那片黑色区域冲去，可能有许多宝藏，但是同样风险也是过分的庞大，做出怎样的选择还是得看你自己。" },
        { "id": "9", "title": "埋藏在手串里的暗黑童话", "story": "童话故事里有一串珠子，是给那些不听话的孩子戴在手上的，目的是为了让他们可以好好的呆在一片区域里不要到处乱跑，而且珠子的做工也是非常的精细，但是每次重新购买的时候店家总会告诉你要到寺庙里去祈福才能产生奇效，但据说很多戴了珠子的孩子都会做噩梦梦到一个被锁在牢笼里的女孩，只不过没有人相信罢了。" },
        { "id": "10", "title": "哇，深海鱼！", "story": "风吹雨打都在工作的浮标，今天又得知渔人收获到了不少财物，据我了解，捕鱼者有不亚于300人，这么多人到底是为了啥？就算是捕小鱼也分不完整呢，也不能每人得到一块，300人同时捕鱼，动荡可不少，要知道在一个月牙湾的区域里，鱼是非常罕见的，而且300人出场捕鱼，肯定是那家伙可不是好惹的啊！！" },
        { "id": "11", "title": "汇合", "story": "今天的风向标有点异常的摆动，连同指南针也有不一样的变化，而且他们都是在发了疯一样乱指，地理博士道科特瞬时就明白了他的研究是正确的，马上收拾了自己的行李，通知了自己的家人在汇合处集合，但是首先迎面袭来的就是6级地震，其次又是海啸，但也阻挡不住道科特前往汇合处的动力。" },
        { "id": "12", "title": "被困沙漠的可怜人", "story": "风吹着沙尘在打滚，浩瀚的沙漠没有一点杂色，两只残影走在沙丘的最上端，快给我水，一个徒步许久的人说着，快看前面有绿洲，两人眼色一对，似乎已经忘记了自己的渴感，冲到了最前面，但是海市蜃楼的效应可不是盖的，只不过他们眼中的绿洲已经变成了他们眼前的巨坑，像是被一颗巨大的陨石砸下来的，或许还有飞船残骸。" },
        { "id": "13", "title": "星球毁灭者", "story": "一颗，两颗，三颗，数着的行星就像是在数钱一样，一个小女孩给自己毁灭过的星球数进行了数数，我还是搞不清楚到底3+3为什么等于6，我一共去过3248个星球，被我毁灭的物种超过了1万个，但是为什么3+3等于6？一个除了头部和上半身以外全是机械部件的男人在小女孩旁边安慰着她，那我下次要不就去一个最多物种的星球吧。" },
        { "id": "14", "title": "旅行“专家”", "story": "我去过了很多地理地貌你们都没有见过的地方，什么沙漠，盆地，那些都是小儿科！一个穿着像是旅专的男人说着，从搭在他嘴上的那撇小胡子看来，这个人就不怎么靠谱，但是却被这么多无知的年轻人围着，他们是图个啥？一个刚出道不久的女生和一个男人在远处谈着，看公告牌上面有这么多的悬赏，每次这些悬赏名单都会在一个月之内被清理，你说会是谁呢？旅行专家很快反应过来，问道这些都是悬赏名单？没错！那看来我这次的旅行终于没有遗憾了！" },
        { "id": "15", "title": "小伙子，我看你骨骼惊奇！", "story": "一个老乞丐出现在我面前，这种诱惑使我按耐不住……当然不是那个乞丐！你在想什么，是武功秘籍！他手里的武功秘籍！“买任意一本武功秘籍，还附赠pdf电子版噢！”" },
        { "id": "16", "title": "一桶能烧出一百块铁锭！", "story": "全球火山频繁爆发，而人类却把岩浆拿来当能源，各种科技发明层出不穷，“火视机”“火脑”等火子科技产品成了人类追捧的潮流。“如果手上没有一把用岩浆充火的手机，我一定会受到同学的嘲笑！”——FirppleXMax开售日现场，一个学生模样的年轻人兴奋地对记者说。" },
        { "id": "17", "title": "爱丽丝？想想都发抖", "story": "我叫林琛，是一只普通的丧尸。我原以为我的世界会很简单，直到那一场黑雨出现。当雨落在其他尸身上时，他们变成了人类这种恐怖的东西，我当时就在楼上，隔着窗户看得瑟瑟发抖。然而，这场世界末日并没有就此结束，人类竟然还会进化，最典型的就是一种叫爱丽丝的物种，他们手上锋利的双爪足以让每只丧尸崩溃！现在是早晨，窗外又出现了人类活动的声音，我还能活多久啊……" },

    ];
var Skill_db =
    [
        { "name": "闪避", "distance": "近", "discribe": "一个带无敌时间的位移技能" },
        { "name": "后撤射击", "distance": "近", "discribe": "闪避过程中按下鼠标左键可释放该技能，对敌人造成轻微硬直效果" },
        { "name": "三连射", "distance": "中", "discribe": "左手一发右手一发两只手合起来一发:p，向指针方向射出强力子弹，最后一发附带击退效果。" },
        { "name": "飘浮炸弹", "distance": "中", "discribe": "抛出一枚飘浮炸弹，对范围内的敌人造成持续电击（or其他表现形式），射击该炸弹可以引爆造成大量AOE伤害" },
        { "name": "守护力场", "distance": "低", "discribe": "在角色周围生成一个保护盾" },
        { "name": "观察弱点", "distance": "中", "discribe": "分析周围敌人的弱点所在，击中弱点可产生暴击伤害。" },
        { "name": "哨卫", "distance": "近", "discribe": "复制一个跟自身相似的角色，向指定方向移动产生视野并标记敌人，存在时间3秒" },
        { "name": "突破极限", "distance": "自身", "discribe": "激发潜能，暂时取消所有属性上限，存在时间20秒" },
        { "name": "双发", "distance": "下次攻击", "discribe": "COPY当前子弹，并且在下一次打出的时候造成两次伤害" },
        { "name": "发掘", "distance": "自身", "discribe": "回复部分能量，神清气爽" },
        { "name": "无惧疼痛", "distance": "自身", "discribe": "暂时移除角色疼痛感，免疫控制1秒，技能瞬放" },
        { "name": "完美打击", "distance": "中", "discribe": "集中所有精力到一个物体上，进行一次完美攻击250%的普通伤害，蓄力2.5秒" },

    ];
var CoreCard_db =
    [
        { "name": "引雷针", "mode": "进攻性", "effect": "\"普通攻击（射击）命中敌人时有25%几率使敌人进入5秒的感电状态。" },
        { "name": "木头人", "mode": "特种型", "effect": "\"每隔5秒发出宕机数据流使距离自身X码内的一名敌人进入2秒的宕机状态。" },
        { "name": "防火墙", "mode": "守护型", "effect": "\"获得一个拥有X点生命值且可以在5秒内未受到攻击后进行自我修复的护盾，护盾若被破坏则从核心里移除此芯片。" },
        { "name": "钱之呼吸", "mode": "特种型", "effect": "获得的金币量增加50%（若敌人会掉落金币则改为：敌人掉落金币的概率增加至100%）" },
        { "name": "BIOS/格式化", "mode": "特种型", "effect": "当受到致命伤害时，免疫这次伤害并恢复自身生命值至50%，并从核心里移除此芯片。" },
        { "name": "键盘艺术", "mode": "特种型", "effect": "与神秘商人（或其他）进行讨价时，成功的概率增加至99%。" },
    ];
var WorldViewBoard_Db = "<p><strong>毕业设计取名尝试：</strong></p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Re-Evolution&mdash;&mdash;进化再起</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Fortune-Space&mdash;&mdash;极乐世界</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Source-Code&mdash;&mdash;源代码</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Public Notice&mdash;&mdash;人头意识</p><p>Exchange&mdash;&mdash;等价交换</p><p><strong>设计故事大纲：</strong></p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Core-&gt;挑选主角-&gt;偶然机会获得Core-&gt;拿到Core后却遇到很多麻烦-&gt;Core可以帮忙解决麻烦-&gt;每次这些麻烦Core都可以迎面瓦解-&gt;解决了许多麻烦后在Core不得知的情况下，主角明白了这些麻烦的最终线索都通往那栋大楼的核心-&gt;Core逐渐把主角引领到大楼的顶层-&gt;主角来到顶层-&gt;最终发现Core里的人格，是AI人格加真实人格的存在-&gt;AI人格想要剔除在Core里的真实人格，真实人格想要获得永生-&gt;此时Core向主角询问，两个房间的门选哪个，获得永生还是面对现实。</p><p>&nbsp;</p><p><strong>故事撰写：</strong></p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 时间到了2088年，人们进入了<strong>数据化世界</strong>的时代，彻底进入了一个想要获得永生的幻想，将所有现实世界中的能源来给中央处理系统供电及提供资源。但是由于<strong>数据化世界</strong>的初代普及，很多资源只有富人们才能享有，而那些活在集装箱房间里的赌徒，逃犯，流浪者，只能给富人们的<strong>数据化世界</strong>在现实的服务器资源进行维护，以确保他们都能够在<strong>数据化世界</strong>享受到无比的乐趣。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 而很多那些没有去过<strong>数据化世界</strong>的穷人们，总是有一个幻想，因为服务器经理说过每年会挖掘穷人基数里的百分之一的人口进入<strong>数据化世界</strong>，可大家总是那么的听着，也没听说过那些进入了<strong>数据化世界</strong>后能发信息回来的人。而且存在的人们都想逃离这破败不堪的现实世界。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 但实际上，能真正意义上享受到<strong>数据化世界</strong>带来的幸福感的或许只有那些富人了，一代接一代的传承下去的。而那些被挑选后的穷人们，则作为Core的核心部分（也就是真实人格部分）给整个<strong>数据化世界</strong>系统的升级作为最基本的资源，使AI的算法得到升级的那些人格，将会得到一次选择的机会。而那些作为无用数据的那些真实人格，或许将会被扼杀。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 数据世界里有非常多的现实世界没有的东西，没有疾病，没有伤痛，幸福感都终将被拉满的那种，但是进入<strong>数据化世界</strong>的设备是坐落在大楼资源厅里的一张核磁共振床，由于思想的前卫，技术的落后，部分潜意识是传输不到数据世界的。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 刚开始进入到数据化世界的人是完全是真实人格，直到他最后做出选项，才会有变化，或是跟Core进行融合，或者是回到原来现实世界中记忆被抹杀后重新创建新的记忆，再继续进行农民的工作。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 身体部分生物能用来进行供电，而人的意识和人格将会被抽取到电脑里进行AI混合计算，现实中人还是那个人，但是实际上他已经到别的地方去了。</p><p>&nbsp;</p><p><strong>其中之一的角色&nbsp;&nbsp;&nbsp; </strong></p><p>主角（R）：</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 在2084年左右R是一个在城市中工作努力的小青年，因为听说数据化世界进行内测中，获得资格的人将会改变自己的生活。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; R非常努力的工作，每天打两份工，为的就是想要到<strong>数据化世界</strong>里面去看一看。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; R 打工打了好几年都没有什么好转的念头，而他的同事，工友，一个个被送到<strong>数据化世界</strong>里，跟他告别的挚友最后也只是给他留了个口头承诺。他的动力终将被消贷完。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 这一年的门票资格选取又开始了，R也凑热闹的来看了一看，没想到却在3亿多人中被抽中了，R做梦也没想到机会来得这么的及时，但是拿到门票资格的要提前做一个身体测试。R没想那么多，把所有自己打工赚来的钱从自己的房子取出来，拿去了高档医院进行身体测试。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <strong>数据化世界</strong>的检测团队和验收团队对R的体检报告查验了一下，允许R通过了，并且安排R到了一个非常庞大的房间，像似一个手术台的样子却又不是，R 躺在床上，想要进入数据化世界的R充满了期待，映射即将完成。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 现实世界中只见R的肉体一动不动，但是屏幕上的R 已经是充满了活跃的气息。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; R的肉体打上了滴管并且被推倒了一个圆柱状的房间里，房间非常大，里面都是手上搭着滴管的人躺在那里，并且颈椎骨处打了个洞用线连接着。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; R的意识在数据化世界里活动着，少数的人会拥有系统创造者特意开发的Core，Core存在于地下，获得Core的人同时也不能让Core被人发现。但是R同样也拿到了Core。Core告诉R他的目的，并且要求R要保护好Core，R开始并没有听从Core的说法，于是遇到麻烦后受了一点伤痛，并且发现不像广告打的那么好，没有伤痛，没有疾病，发现了在这里还是会流血还是会受伤，只不过流出来的血确实流失掉的数据，为了拿回这些数据，Core出了一个主意，R 发现自己单干是行不通了，于是听从了Core的建议。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 得到了自己本来的数据之后，Core让R到一个地方去，说是可以改变他本来的身体素质，于是R 就听Core这么一说，就过去了，来到一个像是通往两个地方的房间，Core让他自己选一个，一个是在数据世界里获得永生，一个是回到现实世界接受命运。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; R选择了永生，于是R的意识被融合到了Core的AI里。</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 而R的肉体，将由一个不成熟的AI算法来加以代替，回到他以前的生活当中，继续为数据化世界的升级和维护工作。</p><p>&nbsp;</p><p><strong>简化版：</strong></p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; R是一个努力工作的小伙，但是生活窘迫，梦想是要到数据化世界里去，偶然之间R获得了通往数据化世界的门票，于是R 的意识进入到了数据化世界里，R在偶然的机会中得到了只存在于地下传闻的Core，R刚开始不信任Core于是受了点伤痛，Core给R出了个拿回自己数据的主意，R之后就开始信任Core了，Core跟R说那里有一个房间可以改变自己的生活，R就听从Core的说法，来到了这个房间，这个房间通往两个地方，Core解释一个通往永生，一个通往现实。R选择了永生，R的意识被融合到了Core的AI算法里，而R的肉体被一个AI的意识代替，融入了他以前的生活，继续为数据化世界的升级和维护工作。</p><p>&nbsp;</p><p><strong>部分补充：</strong></p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; R作为初代，Core之前是没有真实人格存在的。</p>";
