Skill_db = 
[
    {"name":"闪避","distance":"近","discribe":"一个带无敌时间的位移技能"},
    {"name":"后撤射击","distance":"近","discribe":"闪避过程中按下鼠标左键可释放该技能，对敌人造成轻微硬直效果"},
    {"name":"三连射","distance":"中","discribe":"左手一发右手一发两只手合起来一发:p，向指针方向射出强力子弹，最后一发附带击退效果。"},
    {"name":"飘浮炸弹","distance":"中","discribe":"抛出一枚飘浮炸弹，对范围内的敌人造成持续电击（or其他表现形式），射击该炸弹可以引爆造成大量AOE伤害"},
    {"name":"守护力场","distance":"低","discribe":"在角色周围生成一个保护盾"},
    {"name":"观察弱点","distance":"中","discribe":"分析周围敌人的弱点所在，击中弱点可产生暴击伤害。"},
    {"name":"哨卫","distance":"近","discribe":"复制一个跟自身相似的角色，向指定方向移动产生视野并标记敌人，存在时间3秒"},
    {"name":"突破极限","distance":"自身","discribe":"激发潜能，暂时取消所有属性上限，存在时间20秒"},
    {"name":"双发","distance":"下次攻击","discribe":"COPY当前子弹，并且在下一次打出的时候造成两次伤害"},
    {"name":"发掘","distance":"自身","discribe":"回复部分能量，神清气爽"},
    {"name":"无惧疼痛","distance":"自身","discribe":"暂时移除角色疼痛感，免疫控制1秒，技能瞬放"},
    {"name":"完美打击","distance":"中","discribe":"集中所有精力到一个物体上，进行一次完美攻击250%的普通伤害，蓄力2.5秒"},
    
]