var old_story=
[
    {"id":"1","story":"1957年，北京师范大学老焱若教授从人体肘关节能曲能伸受到启发，想到若能根据这个原叮功耻嘉侪黄抽萎处联理，制造一种像人的肘关节一样伸曲灵活的折叠伞，人们携带起来就方便多了，于是，他对现行伞进行改进，设计出了图纸，并亲手制定出加工工艺及模具设计，最后与北京一家机械加工厂——中孚工厂达成协仪，由该厂承制并销售。折叠伞因其携带方便而深受广大群众欢迎，没过多久，便在全国各地流行开来。"},
    {"id":"2","story":"奥菲利娅·德莱尼是一个年轻的女人，被她和父母在奥尔德斯托镇度过的童年所困扰。德莱尼家族几代人都拥有一大片地产，在20世纪被用于许多事情。那里发生的所有可怕事件仍然未知。欧菲莉亚被迫离开小镇，搬到抚养她的姨妈家。现在，10年后，她被过去的影像、压抑的记忆和清醒的梦折磨着。那些和她最亲近的人建议越来越激进的治疗方法。失败之后，欧菲莉亚确信她只能在她出生的地方被治愈。她必须回到德莱尼学院。"},
    {"id":"3","story":"末日后的世界中，幸存的人类未来生存而自相残杀的故事，探索人类在困境下的心理波动。在游戏中我们将会扮演一名中年父亲乔尔，为了完成“萤火虫”组织首领的嘱托而带领着14岁的小女孩艾莉展开了一次足以改变两人一生的旅程。"},
    {"id":"4","story":"“如果当人工智能有了自己的智慧和灵魂，这个世界将何去何从？”这是近年来人们一直在讨论的问题，而《底特律：变人》就像我们讲述了一个这样的故事，主角卡拉是一个为人类服务的家政型机器人，但是却发生了异常拥有了感情，她将与其余有感情的机器人一起探索关于人的定义。我们家在游戏中扮演三名仿生人主角，再一个个选择中决定他们将会成为什么样的人，并见证当机器人拥有感情后，这个世界将会变成什么样。"},
    {"id":"5","story":"《巫师3：狂猎》是一款由波兰著名小说改编而来做角色扮演类单机游戏，是巫师系列作品的第三部，精彩的原著小说赋予了游戏真实的人物设定和扣人心弦的故事剧情，除此之外，游戏还拥有庞大的无缝衔接的世界地图，并采取非线性的任务模式和剧情设定，玩家们将在游戏中做出多种选择，而这些选择也都将影响到故事的最终结局，游戏里的一切都将由玩家们自己演绎。"},
    {"id":"6","story":"《去月球》虽然是一款只有几个小时流程的微型像素风游戏，但是却凭借着精美细腻的演出效果和感人肺腑的故事剧情而获得了无数好评，与其说是有游戏，不如说是一款令人惊艳的视觉小说。故事讲述了两名医生准备为垂死的老人实现临终前的愿望——去月球，虽然老人早已忘记了去月球的理由，但是我们在游戏中随着一些重要物品的出现，将见证老人一生中的许多重要时刻，并解开它过去的秘密，以不一样的方式像玩家们讲述了一场唯美的爱情故事。"},
    {"id":"7","story":"围绕在「Major Fletcher」士兵身上，主角将穿越仅存的人类城市「Bezoar」，冒险旅途上的各种考验与磨难随之而来，同时还得击退来自各方憎恨人类的生化机器人。"},
    
];
var story = 
[
    {"id":"1","title":"改造伞","story":"1957年，北京师范大学老焱若教授从人体肘关节能曲能伸受到启发，想到若能根据这个原叮功耻嘉侪黄抽萎处联理，制造一种像人的肘关节一样伸曲灵活的折叠伞，人们携带起来就方便多了，于是，他对现行伞进行改进，设计出了图纸，并亲手制定出加工工艺及模具设计，最后与北京一家机械加工厂——中孚工厂达成协仪，由该厂承制并销售。折叠伞因其携带方便而深受广大群众欢迎，没过多久，便在全国各地流行开来。"},
    {"id":"2","title":"","story":"奥菲利娅·德莱尼是一个年轻的女人，被她和父母在奥尔德斯托镇度过的童年所困扰。德莱尼家族几代人都拥有一大片地产，在20世纪被用于许多事情。那里发生的所有可怕事件仍然未知。欧菲莉亚被迫离开小镇，搬到抚养她的姨妈家。现在，10年后，她被过去的影像、压抑的记忆和清醒的梦折磨着。那些和她最亲近的人建议越来越激进的治疗方法。失败之后，欧菲莉亚确信她只能在她出生的地方被治愈。她必须回到德莱尼学院。"},
    {"id":"3","title":"美国末日","story":"末日后的世界中，幸存的人类未来生存而自相残杀的故事，探索人类在困境下的心理波动。在游戏中我们将会扮演一名中年父亲乔尔，为了完成“萤火虫”组织首领的嘱托而带领着14岁的小女孩艾莉展开了一次足以改变两人一生的旅程。"},
    {"id":"4","title":"底特律变人","story":"“如果当人工智能有了自己的智慧和灵魂，这个世界将何去何从？”这是近年来人们一直在讨论的问题，而《底特律：变人》就像我们讲述了一个这样的故事，主角卡拉是一个为人类服务的家政型机器人，但是却发生了异常拥有了感情，她将与其余有感情的机器人一起探索关于人的定义。我们家在游戏中扮演三名仿生人主角，再一个个选择中决定他们将会成为什么样的人，并见证当机器人拥有感情后，这个世界将会变成什么样。"},
    {"id":"5","title":"巫师3","story":"《巫师3：狂猎》是一款由波兰著名小说改编而来做角色扮演类单机游戏，是巫师系列作品的第三部，精彩的原著小说赋予了游戏真实的人物设定和扣人心弦的故事剧情，除此之外，游戏还拥有庞大的无缝衔接的世界地图，并采取非线性的任务模式和剧情设定，玩家们将在游戏中做出多种选择，而这些选择也都将影响到故事的最终结局，游戏里的一切都将由玩家们自己演绎。"},
    {"id":"6","title":"去月球","story":"《去月球》虽然是一款只有几个小时流程的微型像素风游戏，但是却凭借着精美细腻的演出效果和感人肺腑的故事剧情而获得了无数好评，与其说是有游戏，不如说是一款令人惊艳的视觉小说。故事讲述了两名医生准备为垂死的老人实现临终前的愿望——去月球，虽然老人早已忘记了去月球的理由，但是我们在游戏中随着一些重要物品的出现，将见证老人一生中的许多重要时刻，并解开它过去的秘密，以不一样的方式像玩家们讲述了一场唯美的爱情故事。"},
    {"id":"7","title":"绝境重启","story":"围绕在「Major Fletcher」士兵身上，主角将穿越仅存的人类城市「Bezoar」，冒险旅途上的各种考验与磨难随之而来，同时还得击退来自各方憎恨人类的生化机器人。"},
    {"id":"8","title":"不要到那里去","story":"众所周知这个城市有一个地方是绝对不能去的，身经百战的战士同样也葬身于此地，但是话不过3秒主角就按捺不住自己的好奇心，想那片黑色区域冲去，可能有许多宝藏，但是同样风险也是过分的庞大，做出怎样的选择还是得看你自己。"},
    {"id":"9","title":"埋藏在手串里的暗黑童话","story":"童话故事里有一串珠子，是给那些不听话的孩子戴在手上的，目的是为了让他们可以好好的呆在一片区域里不要到处乱跑，而且珠子的做工也是非常的精细，但是每次重新购买的时候店家总会告诉你要到寺庙里去祈福才能产生奇效，但据说很多戴了珠子的孩子都会做噩梦梦到一个被锁在牢笼里的女孩，只不过没有人相信罢了。"},
    {"id":"10","title":"哇，深海鱼！","story":"风吹雨打都在工作的浮标，今天又得知渔人收获到了不少财物，据我了解，捕鱼者有不亚于300人，这么多人到底是为了啥？就算是捕小鱼也分不完整呢，也不能每人得到一块，300人同时捕鱼，动荡可不少，要知道在一个月牙湾的区域里，鱼是非常罕见的，而且300人出场捕鱼，肯定是那家伙可不是好惹的啊！！"},
    {"id":"11","title":"汇合","story":"今天的风向标有点异常的摆动，连同指南针也有不一样的变化，而且他们都是在发了疯一样乱指，地理博士道科特瞬时就明白了他的研究是正确的，马上收拾了自己的行李，通知了自己的家人在汇合处集合，但是首先迎面袭来的就是6级地震，其次又是海啸，但也阻挡不住道科特前往汇合处的动力。"},
    {"id":"12","title":"被困沙漠的可怜人","story":"风吹着沙尘在打滚，浩瀚的沙漠没有一点杂色，两只残影走在沙丘的最上端，快给我水，一个徒步许久的人说着，快看前面有绿洲，两人眼色一对，似乎已经忘记了自己的渴感，冲到了最前面，但是海市蜃楼的效应可不是盖的，只不过他们眼中的绿洲已经变成了他们眼前的巨坑，像是被一颗巨大的陨石砸下来的，或许还有飞船残骸。"},
    {"id":"13","title":"星球毁灭者","story":"一颗，两颗，三颗，数着的行星就像是在数钱一样，一个小女孩给自己毁灭过的星球数进行了数数，我还是搞不清楚到底3+3为什么等于6，我一共去过3248个星球，被我毁灭的物种超过了1万个，但是为什么3+3等于6？一个除了头部和上半身以外全是机械部件的男人在小女孩旁边安慰着她，那我下次要不就去一个最多物种的星球吧。"},
    {"id":"14","title":"旅行“专家”","story":"我去过了很多地理地貌你们都没有见过的地方，什么沙漠，盆地，那些都是小儿科！一个穿着像是旅专的男人说着，从搭在他嘴上的那撇小胡子看来，这个人就不怎么靠谱，但是却被这么多无知的年轻人围着，他们是图个啥？一个刚出道不久的女生和一个男人在远处谈着，看公告牌上面有这么多的悬赏，每次这些悬赏名单都会在一个月之内被清理，你说会是谁呢？旅行专家很快反应过来，问道这些都是悬赏名单？没错！那看来我这次的旅行终于没有遗憾了！"},
    
];